УТ.УчетЗадач/src/InformationRegisters/cbr_ДедлайнЗадач/cbr_ДедлайнЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ДедлайнЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Согласующий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Согласовант</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Дедлайн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КомментарийОтказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПереноса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/InformationRegisters/cbr_СобытияПоЗадачам/cbr_СобытияПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_СобытияПоЗадачам</name>
  <resources>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АвторСобытия</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/InformationRegisters/cbr_ДедлайнЗадач/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
Процедура СоздатьЗаписьСогласования(Задача, Согласующий, Дедлайн, КомментарийОценки, 
	ПричинаПереноса = Неопределено) Экспорт
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.КомментарийОценки = КомментарийОценки;
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Согласующий = Согласующий;
	МенеджерЗаписи.Согласовант = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Дедлайн = Дедлайн;
	Если ПричинаПереноса <> Неопределено Тогда
		МенеджерЗаписи.ПричинаПереноса = ПричинаПереноса;
	КонецЕсли;
	МенеджерЗаписи.Записать();
	
	МенеджерЗаписи = РегистрыСведений.cbr_СобытияПоЗадачам.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
	МенеджерЗаписи.АвторСобытия = Пользователи.АвторизованныйПользователь();
	МенеджерЗаписи.Задача = Задача;
	МенеджерЗаписи.Событие = СтрШаблон("Отправлен на согласование дедлайн %1", Формат(Дедлайн, "ДФ=dd.MM.yyyy;"));
	МенеджерЗаписи.Записать();
КонецПроцедуры

Процедура ИзменитьПоследнююЗаписьПоЗадаче(Задача, Отказ, Согласовано, КомментарийОтказа = Неопределено) Экспорт
	Набор = СоздатьНаборЗаписей();
	Набор.Отбор.Задача.Установить(Задача);
	Набор.Прочитать();
	Запись = Набор[Набор.Количество() - 1];
	Запись.Согласовано = Согласовано;
	Запись.Отказ = Отказ;
	Если КомментарийОтказа <> Неопределено Тогда
		Запись.КомментарийОтказа = КомментарийОтказа;
	КонецЕсли;
	Набор.Записать();
	
	МенеджерЗаписи = РегистрыСведений.cbr_СобытияПоЗадачам.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
	МенеджерЗаписи.АвторСобытия = Пользователи.АвторизованныйПользователь();
	МенеджерЗаписи.Задача = Задача;
	ТекстСобытия = "Оценка дедлайна по задаче";
	Если Отказ Тогда
		ТекстСобытия = ТекстСобытия + " не согласована";
	ИначеЕсли Согласовано Тогда
		ТекстСобытия = ТекстСобытия + " согласована";
	КонецЕсли;
	МенеджерЗаписи.Событие = ТекстСобытия;
	МенеджерЗаписи.Записать();
КонецПроцедуры
#КонецОбласти
#КонецЕсли
